import { header } from './template/header'
import { unique } from './template/unique'
import { sign } from './template/sign'

export function docDefinition_PJ1 () {
  return [
    ...header('บันทึกรายงานขอซื้อ','แบบ พจ.1'),
    {text:' '},
    {
      table: {
        headerRows: 1,
        widths: [24,42,'*',42,48,45,45],
        body: [
          [
            {
              text: 'ลำดับที่',
              bold: true,
              alignment: 'center',
              margin: [0, 16, 0, 0]
            },
            {
              text: 'รหัสพัสดุ\nGPSC',
              bold: true,
              alignment: 'center',
              margin: [0, 16, 0, 0]
            },
            {
              text: 'รายการและรายละเอียด',
              bold: true,
              alignment: 'center',
              margin: [0, 24, 0, 0]
            },
            {
              text: 'จำนวน\n(หน่วย)',
              bold: true,
              alignment: 'center',
              margin: [0, 16, 0, 0]
            },
            {
              text: 'ราคาซื้อ\nครั้งหลังสุด\nหน่วยละ\n(บาท)',
              bold: true,
              alignment: 'center'
            },
            {
              text: 'ราคาซื้อ\nครั้งนี้\nหน่วยละ\n(บาท)',
              bold: true,
              alignment: 'center'
            },
            {
              text: 'รวมเงิน\n(บาท)',
              bold: true,
              alignment: 'center',
              margin: [0, 16, 0, 0]
            }
          ],
          [
            {text:'1.', alignment:'center'},
            {},
            {text:'A', alignment:'left'},
            {text:'5 เครื่อง', alignment:'center'},
            {},
            {text:'5,000', alignment:'right'},
            {text:'30,000',alignment:'right'}
          ],
          [
            {},
            {},
            {text:'ภาษีมูลค่าเพิ่ม 7%', alignment:'center'},
            {},
            {},
            {},
            {text:'2,100',alignment:'right'}
          ],
          [
            {
              text:'รวมเป็นเงินทั้งสิ้น',
              colSpan:6,
              alignment:'center',
              border: [false, false, false, false]
            },
            {},{},{},{},{},
            {text:'32,100',alignment:'right'}
          ],
          [
            { text: '', border: [false, false, false, false] },
            { text: '', border: [false, false, false, false] },
            { text: '', border: [false, false, false, false] },
            { text: '', border: [false, false, false, false] },
            { text: '', border: [false, false, false, false] },
            { text: '', border: [false, false, false, false] },
            { text: '', border: [false, true, false, false] }
          ]
        ]
      }
    },
    ...unique(),
    { text: '', pageBreak: 'before' },
    { text: 'และพร้อมกันนี้ได้แนบเอกสารประกอบการพิจารณา ดังนี้'},
    {
      text: [
        ' ',
        {
          text: ' '.repeat(20),
        },
        '1. บันทึกเสนอซื้อ(พัสดุ) ',
        {
          text: ' '.repeat(30),
          decoration: 'underline',
          decorationStyle: 'dotted'
        }
      ]
    },
    {
      text: [
        ' ',
        {
          text: ' '.repeat(20),
        },
        '2. ใบเสนอราคาพัสดุ ',
        {
          text: ' '.repeat(30),
          decoration: 'underline',
          decorationStyle: 'dotted'
        },
        'ชุด'
      ]
    },
    {text:' '},
    {
      columns:[
        [
          {text:'จึงเรียนมาเพื่อโปรดพิจารณา'},
          {text:'1.1 อนุมัติให้จัดซื้อครุภัณฑ์ ครุภัณฑ์การศึกษาจำนวน 1 รายการ วงเงิน 34,499.96 บาท โดยวิธีเฉพาะเจาะจงตามพระราชบัญญัติการจัดซื้อจัดจ้าง และการบริหารบัญญัติการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. 2560 ข้อ 56 (2)ข้อ (ข) และกฎกระทรวง เรื่อง  กำหนดวงเงินการจัดซื้อจัดจ้างพัสดุโดยวิธีเฉพาะเจาะจง วงเงินการจัดซื้อจัดจ้างที่ไม่ทำข้อตกลงเป็นหนังสือ และวงเงินจัดซื้อจัดจ้างในการแต่งตั้งผู้ตรวจรับพัสดุ พ.ศ. 2560 ข้อ 1 ซึ่งอยู่ภายใต้อำนาจจัดซื้อจัดจ้าง  ข้อ 86 ของระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้าง และบริหารภาครัฐ พ.ศ.2560 และได้ตรวจสอบเอกสารการเงินเป็นที่เรียบร้อยแล้ว โดยขอเบิกจากเงินรายได้ ประจำปี 2568จากผู้ขายบริษัท ออล อินสทรูเมนท์ โซลูชัน จำกัด (สำนักงานใหญ่) เนื่องจากมีรายการสินค้าครบตามต้องการ'
            // [
            //   '1.1 อนุมัติให้จัดซื้อครุภัณฑ์  ครุภัณฑ์การศึกษาจำนวน 1 รายการ วงเงิน 34,499.96 บาท',
            //   'โดยวิธีเฉพาะเจาะจงตามพระราชบัญญัติการจัดซื้อจัดจ้าง' ,
            //   'และการบริหารบัญญัติการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. 2560  ข้อ 56 (2)',
            //   'ข้อ (ข) และกฎกระทรวง เรื่อง กำหนดวงเงินการจัดซื้อจัดจ้างพัสดุโดยวิธีเฉพาะเจาะจง ',
            //   'วงเงินการจัดซื้อจัดจ้างที่ไม่ทำข้อตกลงเป็นหนังสือ และวงเงินจัดซื้อจัดจ้างในการแต่งตั้งผู้ตรวจรับพัสดุ พ.ศ. 2560',
            //   'ข้อ 1  ซึ่งอยู่ภายใต้อำนาจจัดซื้อจัดจ้าง ' ,
            //   'ข้อ 86 ของระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้าง และบริหารภาครัฐ พ.ศ.2560 ',
            //   'และได้ตรวจสอบเอกสารการเงินเป็นที่เรียบร้อยแล้ว โดยขอเบิกจากเงินรายได้  ประจำปี 2568',
            //   'จากผู้ขายบริษัท ออล อินสทรูเมนท์ โซลูชัน จำกัด (สำนักงานใหญ่)',
            //   'เนื่องจากมีรายการสินค้าครบตามต้องการ'
            // ]
          },
          {text: ' '},
          {text: '1.2 อนุมัติแต่งตั้งกรรมการตรวจรับพัสดุ'},
          {
            text: [
              ' ',
              {
                text: ' '.repeat(10),
              },
              '1.2.1  ผศ.ดร.ธนวิชญ์  อนุวงศ์พินิจ'
            ]
          },
          {
            text: [
              ' ',
              {
                text: ' '.repeat(10),
              },
              '1.2.2  ผศ.สรพงษ์  วชิรรัตนพรกุล'
            ]
          },
          {
            text: [
              ' ',
              {
                text: ' '.repeat(10),
              },
              '1.2.3  ผศ.ดร.นัชนัยน์  รุ่งเหมือนฟ้า'
            ]
          },
          {text:' '},
          {text:'1.3 ลงนามในใบสั่งซื้อ ที่แนบมานี้'},
          sign('ผู้ช่วยศาสตราจารย์ ดร.ธนวิชญ์ อนุวงศ์พินิจ','ผู้ขอซื้อ'),
          sign('ผู้ช่วยศาสตราจารย์ ดร.พิกุลแก้ว ตังติสานนท์','หัวหน้าภาควิชา')
        ],
        [
          {text:' '},
          {text: 'ส่วนบันทึกงานพัสดุคณะ/สำนัก',bold:true},
          {text:'เรียน   คณบดี'},
          {text: 'เห็นควรโปรดพิจารณา'},
          {text: '1.4 อนุมัติให้ภาควิชาวิศวกรรมคอมพิวเตอร์  จัดซื้อครุภัณฑ์การศึกษา จำนวน 1 รายการ วงเงิน 34,499.96 บาทด้วยเงินรายได้   ตามรายละเอียดข้างต้น'},
          {text: ' '},
          {text: '1.5 อนุมัติแต่งตั้งกรรมการตรวจรับตามเสนอ'},
          {text: '1.6 ลงนามในใบสั่งซื้อ/จ้าง  ที่แนบมานี้'},
          sign('นางสาวพศิกา   แก้วผอม','นักวิชาการพัสดุ'),
          {text:' '},
          {text:'1.7 บันทึกชี้แจงเพิ่มเติม(ถ้ามี)'},
          {
            text:
            [
              ' ',
              {
                text:' '.repeat(90),
                decoration: 'underline',
                decorationStyle: 'dotted'
              }
            ]
          },
          {
            text:
            [
              ' ',
              {
                text:' '.repeat(90),
                decoration: 'underline',
                decorationStyle: 'dotted'
              }
            ]
          },
          sign('นางสาวบุญยืน   กลัดแขก','นักวิชาการพัสดุ'),
          sign('ผู้ช่วยศาสตราจารย์ ดร.เปี่ยมภูมิ  สฤกพฤกษ์','รองคณบดี'),
          {text:' '},
          {text:'1.8 อนุมัติให้ดำเนินการจัดซื้อและลงนามเรียบร้อยแล้ว'},
          sign('รองศาสตราจารย์ ดร.สมยศ   เกียรติวนิชวิไล','ผู้อนุมัติ'),
          {text:'คณบดีคณะวิศวกรรมศาสตร์',alignment:'center'}
        ]
      ],columnGap: 20
    },
    {
      canvas: [
        { type: 'line', x1: 265, y1: -580, x2: 265, y2: 10, lineWidth: 1 }
      ]
    }
  ]
}